In [1]:
import pandas as pd

* Series--- 1d array
* Data Frame--- 2d array(Table format,row & column

In [2]:
a=pd.Series([])
b=pd.Series([1,2,3,4,5])
c=pd.Series((23,4,5,32,34))
d=pd.Series({'a':10,'b':15,'c':34,'d':45})

C:\Users\jaink\AppData\Local\Temp\ipykernel_16620\636687587.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a=pd.Series([])

In [3]:
print(type(a))
print(type(b))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [4]:
a

Series([], dtype: float64)

In [5]:
b

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
c

0    23
1     4
2     5
3    32
4    34
dtype: int64

In [7]:
d

a    10
b    15
c    34
d    45
dtype: int64

In [1]:
import pandas as pd

In [15]:
s=pd.Series([12,56,76,34],index=list('qwert'))

ValueError: Length of values (4) does not match length of index (5)

In [7]:
s2=pd.Series([30,52,3,34,56,75,75])

In [14]:
s2.argmax()

5

In [13]:
s2.argmin()

0

In [8]:
s2

0    12
1    52
2    12
3    34
4    56
5    75
6    75
dtype: int64

In [9]:
s2.value_counts()

12    2
75    2
52    1
34    1
56    1
dtype: int64

In [10]:
s2.argmax

<bound method IndexOpsMixin.argmax of 0    12
1    52
2    12
3    34
4    56
5    75
6    75
dtype: int64>

In [11]:
s2.argmax()

5

In [12]:
s2.argmin()

0

In [18]:
s2.idxmax()

5

# DataFrame

In [19]:
a=pd.DataFrame()
b=pd.DataFrame([1,3,4,5,43])

In [20]:
a

Empty DataFrame
Columns: []
Index: []

In [22]:
type(a)

pandas.core.frame.DataFrame

In [21]:
b

    0
0   1
1   3
2   4
3   5
4  43

In [23]:
type(b)

pandas.core.frame.DataFrame

In [24]:
c=pd.DataFrame([[1,23,34],[34,56,33],[45,76,78]])

In [25]:
c

    0   1   2
0   1  23  34
1  34  56  33
2  45  76  78

In [30]:
d=pd.DataFrame([[1,2,3,5,6],[2,3,4,5,6],[7,98,7,6,5],[7,9,8,6,5],[74,46,42,44,6],[3,5,4,3,2]])d

In [31]:
d

    0   1   2   3  4
0   1   2   3   5  6
1   2   3   4   5  6
2   7  98   7   6  5
3   7   9   8   6  5
4  74  46  42  44  6
5   3   5   4   3  2

In [32]:
d.head() # first five rows

    0   1   2   3  4
0   1   2   3   5  6
1   2   3   4   5  6
2   7  98   7   6  5
3   7   9   8   6  5
4  74  46  42  44  6

In [33]:
d.tail() #last five rows

    0   1   2   3  4
1   2   3   4   5  6
2   7  98   7   6  5
3   7   9   8   6  5
4  74  46  42  44  6
5   3   5   4   3  2

In [36]:
d.tail(1)

   0  1  2  3  4
5  3  5  4  3  2

In [40]:
d.sample(4) # random 4 rows

   0   1  2  3  4
0  1   2  3  5  6
5  3   5  4  3  2
2  7  98  7  6  5
1  2   3  4  5  6

In [43]:
d=pd.DataFrame([[1,2,3],[],[7,98,6,5],[7,95],[74,6],[3,3,2]]) # missing values=NaN

In [42]:
d

    0   1    2    3
0   1   2  3.0  NaN
1   2   3  4.0  NaN
2   7  98  6.0  5.0
3   7  95  NaN  NaN
4  74   6  NaN  NaN
5   3   3  2.0  NaN

In [48]:
C

NameError: name 'np' is not defined

In [52]:
import numpy as np

In [62]:
d1=pd.DataFrame([[1,2,3],[34,np.nan,78],[np.nan,98,6,'Missing'],[7,95,2,34],[74,6],[3,3,2]],columns=['colA','colB','colC','colD'])

In [64]:
d1

   colA  colB  colC     colD
0   1.0   2.0   3.0     None
1  34.0   NaN  78.0     None
2   NaN  98.0   6.0  Missing
3   7.0  95.0   2.0       34
4  74.0   6.0   NaN     None
5   3.0   3.0   2.0     None

In [65]:
d1['colB']

0     2.0
1     NaN
2    98.0
3    95.0
4     6.0
5     3.0
Name: colB, dtype: float64

In [67]:
d1[['colB','colC']]

   colB  colC
0   2.0   3.0
1   NaN  78.0
2  98.0   6.0
3  95.0   2.0
4   6.0   NaN
5   3.0   2.0

In [68]:
d1[['colB','colC']][1:4]

   colB  colC
1   NaN  78.0
2  98.0   6.0
3  95.0   2.0

In [70]:
d1.shape

(6, 4)

In [74]:
d1['colA'].max()

74.0

In [76]:
d1['colB'].min()

2.0

In [81]:
d1['new_col']=[12,43,43,22,44,22]

In [82]:
d1

   colA  colB  colC     colD  new_col
0   1.0   2.0   3.0     None       12
1  34.0   NaN  78.0     None       43
2   NaN  98.0   6.0  Missing       43
3   7.0  95.0   2.0       34       22
4  74.0   6.0   NaN     None       44
5   3.0   3.0   2.0     None       22

In [93]:
d1['colA'+'colB']=d1['colC']

In [94]:
d1

   colA  colB  colC     colD  new_col  colAcolB
0   1.0   3.0   3.0     None       12       3.0
1  34.0  78.0  78.0     None       43      78.0
2   NaN   6.0   6.0  Missing       43       6.0
3   7.0   2.0   2.0       34       22       2.0
4  74.0   NaN   NaN     None       44       NaN
5   3.0   2.0   2.0     None       22       2.0

In [105]:
d1['colF'] = d1['colA']+ d1['colB']

In [106]:
d1

   colA  colB  colC     colD  new_col  colAcolB   colF
0   1.0   3.0   3.0     None       12       3.0    4.0
1  34.0  78.0  78.0     None       43      78.0  112.0
2   NaN   6.0   6.0  Missing       43       6.0    NaN
3   7.0   2.0   2.0       34       22       2.0    9.0
4  74.0   NaN   NaN     None       44       NaN    NaN
5   3.0   2.0   2.0     None       22       2.0    5.0

In [107]:
d1['colB']>50

0    False
1     True
2    False
3    False
4    False
5    False
Name: colB, dtype: bool

In [108]:
f=d1['colB']>50

In [109]:
d1[f]

   colA  colB  colC  colD  new_col  colAcolB   colF
1  34.0  78.0  78.0  None       43      78.0  112.0